//
//  Tutorial.swift
//  Safely
//
//  Created by Zhansen Zhalel on 10.07.2024.
//

import Foundation

struct Tutorial: Hashable {
    var title: String
    var content: String
}

struct TutorialsData {
    static let tutorials = [
        Tutorial(
            title: "Какие виды насилия совершаются дома и в семье?",
            content: """
                Насилие в отношении грудных детей. Это может вызвать серьезные проблемы со здоровьем и даже привести к смерти. Например, люди могут не осознавать, что трясти ребенка нельзя, так как это может стать причиной мозговой травмы или привести к смерти.
                Физическое насилие. В большинстве случаев физическое насилие в отношении детей не влечет за собой тяжелых травм или смерти. Зачастую его применяют, чтобы заставить детей вести себя хорошо. Жестокое обращение и наказание применяются во всем мире. Но дети, естественно, предпочитают, чтобы дисциплина поддерживалась без применения физического наказания.
                Эмоциональное насилие. Зачастую для наказания детей в семье, наряду с физическим насилием, прибегают и к эмоциональному насилию. Оскорбления, брань, угрозы, изоляция или отторжение — все это формы насилия.
                Оставление без надзора.  Это проявляется в том, что семьи не следят за тем, чтобы у детей было все необходимое для безопасного и здорового роста, и не защищают их от опасностей. Девочки и дети-инвалиды наиболее подвержены данному виду насилия.
                Сексуальное насилие. Детей принуждают заниматься сексом или подвергают сексуальным домогательствами. Такие действия совершаются главным образом мужчинами и мальчиками в своих семьях.
                Ранний брак. Во всем мире 82 миллиона девочек выходят замуж до достижения 18 лет. Многие из них гораздо моложе, и их принуждают выходить замуж за старших по возрасту мужчин. В связи с этим они могут столкнуться с насилием, включая принудительный секс.
                Пагубная традиционная практика. Некоторые традиционные обряды в отношении детей связаны с насилием, например:
                проведение калечащих операций на женских половых органах (женское обрезание);
                нанесение шрамов, клеймение, нанесение ожогов и другие такого рода методы украшения тела;
                обряды инициации с применением насилия, в ходе которых мальчиков или девочек заставляют совершать насильственные действия или применяют насилие по отношению к ним с тем, чтобы их можно было признать взрослыми;
                убийства чести, при которых мужчины убивают девочек во имя «чести» семьи, например за внебрачный секс или отказ от принудительного вступления в брак;
                некоторых детей обвиняют в колдовстве,  и вследствие этого за ними перестают ухаживать, их подвергают жестокому обращению или даже  убивают; некоторых используют в качестве жертв в колдовских целях.
                Домашнее насилие. Многие дети сталкиваются с домашним насилием в своем доме, обычно с насилием в отношениях между родителями. Подобное насилие может сказаться на чувствах детей, на их развитии и отношениях с другими людьми на протяжении всей дальнейшей жизни. Когда в семье применяется насилие в отношении женщины, зачастую оно совершается и в отношении детей.
                Родители, мачехи/отчимы, приемные родители, братья и сестры, родственники и другие лица, присматривающие за детьми, могут нести ответственность за насилие в отношении детей дома.
                """
        ),
        Tutorial(
            title: "Вы не одиноки",
            content: """
                Если вы стали жертвой домашнего насилия, это не ваша вина. Вы не заслуживаете того, чтобы быть жертвой насилия. Помощь существует.
                Домашнее насилие - это образец принудительного поведения, которое характеризуется доминацией и контролем одного человека над другим, обычно сексуальным партнером, с помощью физического, психологического, эмоционального, вербального, сексуального и/или экономического насилия.
                ♦ Каждая 4 женщина и каждый 7 мужчина подвергаются серьезному физическому насилию со стороны полового партнера (Национальный опрос на тему половых партнеров и сексуального насилия – NISVS, 2014 г.).
                ♦ Практически каждая 5 женщина и каждый 59 мужчина подвергались изнасилованию, обычно со стороны полового партнера (NISVS, 2014 г.).
                ♦ Каждая 6 женщина и каждый 19 мужчина подвергались психологическому террору, часто со стороны полового партнера (NISVS, 2014 г.).
                ♦ 6,6% детей подвергаются физическому домашнему насилию каждый год, что составляет более 5 миллионов детей (Органы ювенальной юстиции и превенции делинквентности – OJJDP, 2011 г.).
                """
        ),
        Tutorial(
            title: "Что такое домашнее насилие?",
            content: """
                Часто домашнее насилие - это больше, чем физическое насилие. Часто может включать разные типы контролирующего поведения. Вот несколько форм домашнего насилия:
                ФИЗИЧЕСКОЕ НАСИЛИЕ 
                ♦ Удары
                ♦ Избиение
                ♦ Удары ногами
                ♦ Удушье
                ♦ Толкание 
                ♦ Избиение
                ♦ Порка
                
                ВЕРБАЛЬНОЕ НАСИЛИЕ
                ♦ Постоянная критика
                ♦ Насмешки
                ♦ Унижающие замечания 
                ♦ Крики
                ♦ Сквернословие 
                ♦ Брань
                ♦ Перебивание
                
                СЕКСУАЛЬНОЕ НАСИЛИЕ
                ♦ Принудительный секс
                ♦ Требование сексуальных
                актов
                ♦ Унизительное
                обращение
                
                ИЗОЛЯЦИЯ
                ♦ Препятствование встреч
                с друзьями и
                родственниками
                ♦ Контроль телефонных
                звонков
                ♦ Прочтение почты,
                текстов или сообщений 
                ♦ Контролирование
                повседневной
                деятельности
                ♦ Отбирание ключей от
                машины
                ♦ Уничтожение паспорта
                или документов
                
                ДАВЛЕНИЕ
                ♦ Вызывание чувства вины 
                ♦ Сердитость
                ♦ Манипуляция детьми и
                членами семьи
                ♦ Постоянное настаивание
                на собственной правоте 
                ♦ Создание невозможных "правил"
                """
        ),
        Tutorial(
            title: "Почему женщины не рассказывают о насилии?",
            content: """
                В нашем обществе иногда считают, что женщины менее важны, чем мужчины, потому что они слабее.
                
                Большинство женщин не рассказывают о насилии.
                Им стыдно. Они думают, что им не поверят. Женщины боятся, что их накажут,
                если они кому-то расскажут о своей беде.
                
                Женщины боятся, что семья перестанет заботиться о них.
                
                Многие женщины считают нормальным,
                что на их просьбы о помощи близкие люди не обращают внимания. Они думают, что заслуживают неуважительного отношения к себе.
                
                Но это не так. Насилие имеет тяжёлые последствия для здоровья. Травмы остаются на всю жизнь. Из-за побоев появляются болезни.
                
                Психика человека тоже страдает из-за насилия. Человек переживает стресс. Теряет доверие к людям.
                
                При знакомстве с новыми людьми
                женщина испытывает страх и неуверенность в себе. Помните, что любой человек может пострадать
                от домашнего насилия.
                """
        )
    ]
}
